import { Component, OnInit } from '@angular/core';
import { Router } from '@angular/router';

@Component({
  selector: 'app-services',
  templateUrl: './services.component.html',
  styleUrls: ['./services.component.css']
})
export class ServicesComponent implements OnInit {

  constructor(private router: Router) { }
  display: boolean = false;
  title;
  description;
  data = [
    {title: 'تأمين الحوادث الشخصية', description: 'هى وثيقة توفر التعويض عند حدوث حادث غير متوقع حيث يتم دفع التعويض في حالة وفاة المؤمن له أو اصابته بإصابة جسمانية أدت إلي عجزه بسبب حادث مباشر ناتج عن وسائل خارجية و واضحة وهذه الإصابة تمنع المؤمن عليه من مزاولة عمله المعتاد'},
    {title: 'تأمين طبى', description: 'تقدم شركة أمنلى دوت كوم برامج تأمين طبى وجماعى من خلال شركات التأمين بتغطيات محلية ودولية وتشمل تكاليف الكشف الطبي - التحاليل والاقامة بالمستشفيات - والأدوية وعلاج الأسنان والنظر وأمراض القلب والأمراض المزمنة وكذلك تقوم شركة التأمين المتعاقد معها بالسداد مباشرة للمستشفيات المعتمدة لديها أو العيادات دون أي سداد مصروفات من المريض  ويكون طبقا لشروط التعاقد ويتم التأمين من خلال شركات التأمين المعتمدة من الهيئة العامة للرقابة المالية'},
    {title: 'تأمين السفر', description: 'عند سفرك للخارج تذكر طلب وثيقة تأمين السياحة متعددة التغطيات التى تقدمها شركة أمنلي دوت كوم من خلال شركات التأمين ومن مميزات هذه الوثيقة تغطية النفقات الطبية وتكاليف الإقامة بالمستشفيات وتكاليف الحوادث الشخصية ونقل الحقائب والمتعلقات الشخصية ونفقات تأخير رحلة متعاقد عليها ويتم التأمين من خلال شركات التأمين المعتمدة من الهيئة العامة للرقابة المالية'},
    {title: 'تأمين بحرى', description: ''},
    {title: 'تأمين السيارة', description: 'هل تستطيع أن تتخيل حياتك بدون سيارتك نحن نعلم أن القيادة ليست من الامور الامنة وبالأخص مع ارتفاع معدلات حوادث الطرق وسرقة السيارات تقدم شركة أمنلي دوت كوم تأمين السيارات بأفضل الأسعار وتغطيات شاملة وخدمات مميزة حتى إنهاء إجراءات الحصول علي التعويض لدى شركة التأمين المتعاقد معها ويتم التأمين من خلا شركات التأمين المعتمدة من الهيئة العامة للرقابة المالية'},
    {title: 'تأمين الهندسى', description: ''},
    {title: 'تأمين المنزل', description: 'توفر شركة أمنلى دوت كوم حلول تأمينية مخصصة لحماية المنزل من مبانى - اثاث - اجهزة - مجوهرات - تحف واخطار الحريق وأعمال الشغب و إنفجار مواسير المياه أو الغاز والسطو وكسر الزجاج ويتم التأمين من خلال شركات التأمين المعتمدة من الهيئة العامة للرقابة المالية'},
  ];

  ngOnInit() {
  }

  onNavigate(url: string) {
    console.log('here');
    // this.router.navigate(['/','insurance'], {queryParams: {page: 'individual'}}).then(res => {
    //   window.scrollTo(0,0);
    // });
  }
  showDialog(i: number) {
    this.display = !this.display;
    this.title = this.data[i].title;
    this.description = this.data[i].description;
  }
  closeDialog() {
    this.display = false;
  }

}
