import { Router, NavigationEnd } from '@angular/router';
import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-aboutus',
  templateUrl: './aboutus.component.html',
  styleUrls: ['./aboutus.component.css']
})
export class AboutusComponent implements OnInit {
  text: string;
  constructor(private router: Router) { }

  ngOnInit() {
    this.router.events.subscribe((evt) => {
      if (!(evt instanceof NavigationEnd)) {
          return;
      }
      document.body.scrollTop = 0;
  });
    this.text = ` حصلت شركة أمنلي دوت كوم للوساطة التأمينية على الترخيص من الهيئة العامة للرقابة المالية بتاريخ يوليو ٢٠١٩ تحت رقم (٩٠) برأس مال
    مرخص به عشرون مليون جنيه مصري ، ورأس مال مصدر مليوني جنيه مصري
    مدفوع النصف وفقا الاحكام القانون
    أسسها نخبة من المؤسسات المالية العالمية ورجال الاقتصاد والاعمال في مصر نذكر منهم:
     <ul>
     <li>
     شركة نوتنج هيل فاينانس المحدودة
     </li>
     <li>
     نيـو تـريـفــيل القــابـضـــة االمحدودة
</li>
<li>
     الاستاذ الدكتور/ اشـــرف الشرقــاوي
</li>
<li>
     السيد الاســــتاذ/ عمر منصور عـامر
</li>
     </ul>
    فقد حرصت الشركه على ان تبدأ أعمالها وفقا لاحدث الانظمة الادارية والتسويقيه والتكنولوجية العالمية . . وا
    لاستعانة بأفضل الخبرات. . واعطاء الاولوية دائما لرضاء وراحة العملاء . . وتقديم خدمات متميزة لهم. . واتاحه
    امكانيه التواصل معهم على مدار اليوم. . .
    كما ان شركه أمنلى دوت كوم للوساطه التامينيه تتعامل مع جميع شركات التامين المعتمده بالسوق المصرى
    وتوفرمن خلالها انسب التغطيات وبافضل الشروط معتمده فى ذلك على عنصر الخبره والدراسه بالاضافه الى توفير
    الحل التامينى المناسب للعميل من خلال دراسه وتقييم الاخطار التى يتعرض لها وتحديد التغطيات المناسبه طبقا
    لطبيعه نشاطه واحتياجاته .
    كما تهدف الشركه الى رفع المستوى المهنى لخدمات الوساطه التامينيه فى مصر حيث يعمل بشركتنا نخبه من
    افضل الخبرات المتميزه والمتخصصه فى جميع فروع التامين باختلاف انواعها الخاصه بالشركات او الافراد
    وبمستوى مهنى عالى ومتميز لتقديم افضل الخدمات التامينيه لعملائنا من خلال شركات التامين
    `;


  }

}
